caonguyenheo/cafe_milk/cc3220mode_module/programs/p2p/app/system.c
/*
 * system.c
 *
 *  Created on: Aug 30, 2018
 *      Author: Admin
 */

#include "system.h"
#include "tcp.h"
#include "shelltask.h"
#include "network_handler.h"
#include "sflash.h"
#include "userconfig.h"
#include "main_thread.h"
#include "cc3220_system.h"



/* BSD support */
#include <netinet/in.h>
#include <arpa/inet.h>
#include <sys/socket.h>
#include <ti/net/slnetutils.h>
#include <sys/select.h>
#include <sys/types.h>


#define TEST_FILENAME_MY        "/sys/test2.txt"
#define FILENAME_MY        		"newfile1.text"




char ap_ssid[MAX_AP_SSID_LEN] = {0};
char ap_pass[MAX_AP_PASS_LEN] = {0};
char ap_sec[MAX_AP_SEC_LEN] = {0};
extern int32_t gMode;
char lineBreak[]                = "\n\r";
unsigned long  g_ulDestinationIp;
unsigned int   g_uiPortNum = PORT_NUM;
volatile unsigned long  g_ulPacketCount = TCP_PACKET_COUNT;
unsigned char  g_ucConnectionStatus = 0;
unsigned char  g_ucSimplelinkstarted = 0;
unsigned long  g_ulIpAddr = 0;

//char gBuff_tx[1019]= {0};
/*unsigned char gBuff_tx[TCP_SIZE]= {0};
unsigned char gBuff_rx[TCP_SIZE] = {0};
unsigned char gBuff_Temp[TCP_SIZE] = {0};
extern unsigned char tx_buffer1[];*/

#if 0
char *gBuff_tx2[] =
{
		{"helpStr, cmdHelpCallback, printHelpUsage"},
		{"scanStr, cmdScanCallback, printScanUsage"},
		{"setPolicyStr, cmdSetPolicyCallback, printSetPolicyUsage"},
		{"wlanConnectStr, cmdWlanConnectCallback, printWlanConnectUsage"},
		{"ap_start_str, cmdWlanStartApCallback, printWlanStartApUsage"},
		{"ap_stop_str, cmdWlanStopApCallback, printWlanStopApUsage"},
		{"wlanDisconnectStr, cmdWlanDisconnectCallback, printWlanDisconnectUsage"},
		{"ConnectedStationsStr, cmdConnectedStationsCallback, printConnectedStationsUsage"},
		{"pingStr, cmdPingCallback, printPingUsage"},
		{"sendStr, cmdSendCallback, printSendUsage"},
	    {"recvStr, cmdRecvCallback, printRecvUsage"},
	    {"createFilterStr, cmdCreateFilterCallback, printCreateFilterUsage"},
	    {"enableFilterStr, cmdEnableFilterCallback, printEnableFilterUsage"},
	    {"disableFilterStr, cmdDisableFilterCallback, printDisableFilterUsage"},
	    {"deleteFilterStr, cmdDeleteFilterCallback, printDeleteFilterUsage"},
	    {"enableWoWLANStr, cmdEnableWoWLANCallback, printEnableWoWLANUsage"},
		{"mDNSAdvertiseStr, mDNSAdvertiseCallback, printmDNSAdvertiseUsage"},
		{"mDNSQueryStr, mDNSQueryCallback, printmDNSQueryUsage"},
		{"radiotool_Str, cmdTranceiverModecallback, printTranceiverModeUsage"},
		{"p2pStartcmdStr, cmdP2PModecallback, printP2PStartUsage"},
		{"p2pStopcmdStr, cmdP2PStopcallback, printP2PStopUsage"},
		{"clearStr, cmdClearcallback, printClearUsage "}
};
#endif

#if OPENFILE
char gcBsdBuf_File[BUFF_LEN_FILE]= {0};
char gcBsdBuf_File_Rx[BUFF_LEN_FILE]= {0};
#endif

int audio_mode = -1;
//extern char buff_In[];
extern sem_t guserconfig_init;
void printBorder(char ch, int n);
void DisplayUsage();
static char *ParseString (char *instring);
void PrintIPAddress(unsigned char ipv6, void *ip);
int32_t ipv4AddressParse(char *str, uint32_t *ipv4ip);



void printBorder(char ch, int n)
{
    int        i = 0;

    for(i=0; i<n; i++)
    {
    	putch(ch);
    }
}
void DisplayUsage()
{
	printBorder('=', 100);
	UART_PRINT(lineBreak);
	UART_PRINT("\t\t\t\tAT COMMAND SUPPORT:\r\n");
    UART_PRINT("\tconnect [SSID] [PASSWD]\t");
    UART_PRINT("\tdisconnect\t");
    UART_PRINT("\treboot\n\r");
    UART_PRINT("\tsend -i [ip] -p [port number] [data] [nb 0/1] [tx 0/1]\t");
    UART_PRINT("recv -p [port number] [nb 0/1] [tx 0/1]\n\r");
    UART_PRINT("\tsendfile -i [ip] -p [port number]\t");
    UART_PRINT("\t\trecvfile -p [port number]\n\r");
    UART_PRINT("\tip\t");
    UART_PRINT("\t\t\t\t\t\tclear\n\r"); //clear screen
    UART_PRINT("\tresetfactory\n\r");
    printBorder('=', 100);
    UART_PRINT(lineBreak);

}

#if 0
int32_t DisplayAppBanner(char* appName, char* appVersion)
{
     int32_t            ret = 0;
     uint8_t            macAddress[SL_MAC_ADDR_LEN];
     uint16_t           macAddressLen = SL_MAC_ADDR_LEN;
     uint16_t           ConfigSize = 0;
     uint8_t            ConfigOpt = SL_DEVICE_GENERAL_VERSION;
     SlDeviceVersion_t ver = {0};

     ConfigSize = sizeof(SlDeviceVersion_t);

    /* Print device version info. */
    ret =
        sl_DeviceGet(SL_DEVICE_GENERAL, &ConfigOpt, &ConfigSize,
                     (uint8_t*)(&ver));
    ASSERT_ON_ERROR(ret, DEVICE_ERROR);

    /* Print device Mac address */
    ret = sl_NetCfgGet(SL_NETCFG_MAC_ADDRESS_GET, 0, &macAddressLen,
                       &macAddress[0]);
    ASSERT_ON_ERROR(ret, WLAN_ERROR);

    UART_PRINT(lineBreak);
    UART_PRINT("\t");
    printBorder('=', 46);
    UART_PRINT(lineBreak);
    UART_PRINT("\t   %s Ver: %s",appName, appVersion);
    UART_PRINT(lineBreak);
    UART_PRINT("\t");
    printBorder('=', 46);
    UART_PRINT(lineBreak);
    UART_PRINT(lineBreak);
    UART_PRINT("\t CHIP: 0x%x",ver.ChipId);
    UART_PRINT(lineBreak);
    UART_PRINT("\t MAC:  %d.%d.%d.%d",ver.FwVersion[0],ver.FwVersion[1],
               ver.FwVersion[2],
               ver.FwVersion[3]);
    UART_PRINT(lineBreak);
    UART_PRINT("\t PHY:  %d.%d.%d.%d",ver.PhyVersion[0],ver.PhyVersion[1],
               ver.PhyVersion[2],
               ver.PhyVersion[3]);
    UART_PRINT(lineBreak);
    UART_PRINT("\t NWP:  %d.%d.%d.%d",ver.NwpVersion[0],ver.NwpVersion[1],
               ver.NwpVersion[2],
               ver.NwpVersion[3]);
    UART_PRINT(lineBreak);
    UART_PRINT("\t ROM:  %d",ver.RomVersion);
    UART_PRINT(lineBreak);
    UART_PRINT("\t HOST: %s", SL_DRIVER_VERSION);
    UART_PRINT(lineBreak);
    UART_PRINT("\t MAC address: %02x:%02x:%02x:%02x:%02x:%02x",
               macAddress[0],
               macAddress[1],
               macAddress[2],
               macAddress[3],
               macAddress[4],
               macAddress[5]);
    UART_PRINT(lineBreak);
    UART_PRINT(lineBreak);
    UART_PRINT("\t");
    printBorder('=', 44);
    UART_PRINT(lineBreak);
    UART_PRINT(lineBreak);

    return(ret);
}
#endif

static char *ParseString (char *instring)
{
    char *ptr1 = instring, *ptr2 = instring;

    if (instring == NULL)
        return instring;

