caonguyenheo/cafe_milk/cc3220mode_module/programs/p2p/app/system.c
    while (isspace (*ptr1))
        ptr1++;

    while (*ptr1)
    {
        if (*ptr1 == '+')
        {
            ptr1++; *ptr2++ = ' ';
        }
        else if (*ptr1 == '%' && isxdigit (*(ptr1 + 1)) && isxdigit (*(ptr1 + 2)))
        {
            ptr1++;
            *ptr2    = ((*ptr1 >= '0' && *ptr1 <= '9') ? (*ptr1 - '0') : ((char)toupper(*ptr1) - 'A' + 10)) << 4;
            ptr1++;
            *ptr2++ |= ((*ptr1 >= '0' && *ptr1 <= '9') ? (*ptr1 - '0') : ((char)toupper(*ptr1) - 'A' + 10));
            ptr1++;
        }
        else
            *ptr2++ = *ptr1++;
    }

    /*while (ptr2 > instring && isspace(*(ptr2 - 1)))
        ptr2--;*/

    *ptr2 = '\0';

    return instring;
}
void PrintIPAddress(unsigned char ipv6,
                    void *ip)
{
    uint32_t        *pIPv4;
    uint8_t         *pIPv6;
    int32_t          i=0;

    if(!ip)
    {
        return;
    }

    if(ipv6)
    {
        pIPv6 = (uint8_t*) ip;

        for(i = 0; i < 14; i+=2)
        {
            UART_PRINT("%02x%02x:", pIPv6[i], pIPv6[i+1]);
        }

        UART_PRINT("%02x%02x", pIPv6[i], pIPv6[i+1]);
    }
    else
    {
        pIPv4 = (uint32_t*)ip;
        UART_PRINT("%d.%d.%d.%d",
                    SL_IPV4_BYTE(*pIPv4,3),
                    SL_IPV4_BYTE(*pIPv4,2),
                    SL_IPV4_BYTE(*pIPv4,1),
                    SL_IPV4_BYTE(*pIPv4,0));
    }
    return;
}
int32_t ipv4AddressParse(char *str, uint32_t *ipv4ip)
{
    volatile int32_t i = 0;
    uint32_t n;
    uint32_t ipv4Address = 0;
    char             *token;

    token = strtok(str, ".");
    if(token)
    {
        n = (int)strtoul(token, 0, 10);
    }
    else
    {
        return(-1);
    }

    while(i < 4)
    {
       if((token != NULL) && (n < 256))
       {
           ipv4Address |= n;
           if(i < 3)
           {
               ipv4Address = ipv4Address << 8;
           }
           token=strtok(NULL,".");
           if (token)
           {
               n = (int)strtoul(token, 0, 10);
           }
           i++;
       }
       else
       {
           return -1;
       }
    }
    *ipv4ip = ipv4Address;
/*    ipv4ip = &ipv4Address;
    UART_PRINT("ipv4ip parser:%x\n\r", *ipv4ip);*/
    return(0);
}
int sec_string_to_num()
{
	int l_len=strlen(ap_sec);
	int i;
//	int iRetval = -1;
	for(i=0;i<l_len;i++)
	{
		ap_sec[i]=tolower(ap_sec[i]);
	}
	UART_PRINT("Wifi Sec %s\r\n",ap_sec);
	if (strcmp (ap_sec, "open" )==0)
	{
//		iRetval = 0;
		return 0;
	}
	if (strcmp (ap_sec, "wep" )==0)
	{
//		iRetval = 1;
		return 1;
	}
	if (strcmp (ap_sec, "wpa" )==0)
	{
//		iRetval = 2;
		return 2;
	}

	return 2;
}
int32_t set_wireless_config(char *ssid, char *pass, char *auth_type)
{
    // auth_type not used
    if (ssid == NULL || pass == NULL)
    {
        return -1;
    }
    // URL decoder
    ParseString(ssid);
    ParseString(pass);
    UART_PRINT("SSID:%s, PASS:%s, SEC:%s\r\n", ssid, pass, auth_type);

    memset(ap_ssid, 0, MAX_AP_SSID_LEN);
    memset(ap_pass, 0, MAX_AP_PASS_LEN);
    memset(ap_sec, 0, MAX_AP_SEC_LEN);

    memcpy(ap_ssid, ssid, strlen((char const *)ssid));
    memcpy(ap_pass, pass, strlen((char const *)pass));
    memcpy(ap_sec, auth_type, strlen((char const *)auth_type));

    return 0;
}

int32_t get_wireless_config()
{
	int ret_val = -1;

    ret_val = userconfig_get(ap_ssid, MAX_AP_SSID_LEN, WIFI_SSID_ID);
    if (ret_val < 0)
    {
        UART_PRINT("Can not read WIFI SSID, error=%d\r\n", ret_val);
    }

    ret_val = userconfig_get(ap_pass, MAX_AP_PASS_LEN, WIFI_KEY_ID);
    if (ret_val < 0)
    {
        UART_PRINT("Can not read WIFI KEY, error=%d\r\n", ret_val);
    }

    UART_PRINT("Get SSID and PASS\n\r");
    UART_PRINT("SSID:%s, PASS:%s\n\r", ap_ssid, ap_pass);
    return ret_val;
}

void fw_version_format(char* l_output, char* l_input)
{
	l_output[0]=l_input[0];
	l_output[1]=l_input[1];
	l_output[2]='.';
	l_output[3]=l_input[2];
	l_output[4]=l_input[3];
	l_output[5]='.';
	l_output[6]=l_input[4];
	l_output[7]=l_input[5];
	l_output[8]=0;
}

int ParseNProcessCmd1(char *pcCmdBuffer)
{
	char *pcInpString;
	int iRetVal = -1;
	pcInpString = strtok(pcCmdBuffer, " ");
	if ((!strcmp(pcInpString, "s")) || (!strcmp(pcInpString, "S")))
	{
		char *ssid = NULL;
		char *passwd = NULL;
		char *authtype = NULL;

		int lRetVal;

		ssid = strtok(NULL, " ");
		if (ssid == NULL)
		{
			return -1;
		}
		passwd = strtok(NULL, " ");
		if (passwd == NULL)
		{
			return -1;
		}

		authtype = strtok(NULL, " ");
		if (authtype == NULL)
		{
			return -1;
		}

		UART_PRINT("\r\n\t- TRY TO CONNECT: %s %s %s\r\n", ssid, passwd, authtype);
		set_wireless_config(ssid, passwd, authtype);
		Network_IF_DeInitDriver();
		lRetVal = Network_IF_InitDriver(ROLE_STA);
		if (lRetVal < 0)
		{
			ERR_PRINT(lRetVal);
			return REGISTRATION_ERROR_SETMODESTA;
		}
		lRetVal = Network_IF_Connect2AP_static_ip(ssid, passwd, 5);

		if (lRetVal<0)
		{
			UART_PRINT("Connect to AP fail\n");
			return REGISTRATION_ERROR_CONNECTAP;
		}

		return lRetVal;
	}
	else if(!strcmp(pcInpString, "scan"))
	{
	    sl_WlanProfileDel(0xFF);
	    ConfigureSimpleLinkToDefaultState(gMode);
	    InitializeAppVariables();
		Network_IF_provisionAP();
	    sl_Stop(0xFF);
	    iRetVal = Network_IF_WifiSetMode(ROLE_AP);

	    if (iRetVal < 0)
	    {
	        return REGISTRATION_ERROR_SETMODEAP;
	    }
	    iRetVal = 1;
	}
	else if(!strcmp(pcInpString, "clear"))
	{
		ClearTerm();
	    iRetVal = 1;
	}
	return iRetVal;
}
int system_init(void)
{
//	int RetVal = -1;
//	InitFile_Test();
	int ret_val = -1;

//	sl_Start(0, 0, 0);


	userconfig_init();
	userconfig_flash_read();
	sem_post(&guserconfig_init);

    ret_val = userconfig_get(ap_ssid, MAX_AP_SSID_LEN, WIFI_SSID_ID);
    if (ret_val < 0)
    {
        UART_PRINT("Can not read WIFI SSID, error=%d\r\n", ret_val);
    }

    ret_val = userconfig_get(ap_pass, MAX_AP_PASS_LEN, WIFI_KEY_ID);
    if (ret_val < 0)
    {
        UART_PRINT("Can not read WIFI KEY, error=%d\r\n", ret_val);
    }

    UART_PRINT("SSID:%s, PASS:%s\r\n", ap_ssid, ap_pass);
/*    UART_PRINT("\r\nNetwork init start\r\n");

