caonguyenheo/cafe_milk/cc3220mode_module/programs/p2p/app/system.c
    InitializeAppVariables();
    Network_IF_provisionAP();*/

	return 0;
}
void system_reboot()
{
	/*
    PRCMMCUReset(TRUE);
    // PRCMSOCReset();
	*/

	// Another reboot method
	sl_WlanPolicySet(SL_POLICY_PM , SL_LOW_LATENCY_POLICY, NULL, 0);
//	sl_Stop(0);
	MAP_PRCMHibernateWakeupSourceEnable(PRCM_HIB_SLOW_CLK_CTR);
	MAP_UtilsDelay(8000000);
	MAP_PRCMHibernateIntervalSet(330);
	MAP_PRCMHibernateEnter();
    while(1);

}
void system_reboot_1()
{

    PRCMMCUReset(TRUE);
}

int system_registration()
{
	int RetVal = 0;
//	char acCmdStore[512];

    UART_PRINT("Network init start\n\r");

    sl_WlanProfileDel(0xFF);
    ConfigureSimpleLinkToDefaultState(gMode);
    InitializeAppVariables();
    RetVal = Network_IF_WifiSetMode(ROLE_STA);
    if (RetVal < 0)
    {
        return REGISTRATION_ERROR_SETMODESTA;
    }

    UART_PRINT("Network init done\n\r");
    Network_IF_provisionAP();
    UART_PRINT("Scan wifi done\n\r");
    RetVal = sl_Stop(0xFF);
    RetVal = Network_IF_WifiSetMode(ROLE_AP);

    if (RetVal < 0)
    {
        return REGISTRATION_ERROR_SETMODEAP;
    }

#if 0

    char acCmdStore[512];
    do
    {

    	UART_PRINT("Select SSID:");
    	UART_PRINT("\n\r");
		RetVal = GetCmd(acCmdStore, sizeof(acCmdStore));

		if (RetVal < 0)
		{

			UART_PRINT("Command length exceeded 512 bytes in system \n\r");
		}
		else
		{
			RetVal = ParseNProcessCmd1(acCmdStore);
			if (RetVal < 0)
			{
				UART_PRINT("Error in processing command in system\n\r");
			}
		}
		UART_PRINT("\n\r");
    }while(RetVal != 0);



#endif
#if 1
    char SSID[32]="AlincoVN2";
    char SSID_KEY[64]="aevn2016";
    char AUTHTYPE[8]="WPA";
	set_wireless_config(SSID, SSID_KEY, AUTHTYPE);
	Network_IF_DeInitDriver();
	RetVal = Network_IF_InitDriver(ROLE_STA);
	if (RetVal < 0)
	{
		ERR_PRINT(RetVal);
		return REGISTRATION_ERROR_SETMODESTA;
	}
    RetVal = Network_IF_Connect2AP_static_ip(ap_ssid, ap_pass, 0);
    if (RetVal<0)
    {

        UART_PRINT("Connect to AP fail\n");

        return REGISTRATION_ERROR_CONNECTAP;
    }
#endif

    RetVal = userconfig_set(ap_ssid, strlen(ap_ssid), WIFI_SSID_ID);
    if (RetVal < 0)
    {
		UART_PRINT("Cannot write ap_ssid, error=%d\n\r", RetVal);
    }

    RetVal= userconfig_set(ap_pass, strlen(ap_pass), WIFI_KEY_ID);
    if (RetVal < 0)
    {
		UART_PRINT("Cannot write ap_pass, error=%d\n\r", RetVal);
    }

    RetVal = userconfig_set(NULL, DEV_REGISTERED, MODE_ID);
    if (RetVal < 0)
    {
        UART_PRINT("Cannot write boot flag, error=%d\r\n", RetVal);
    }
    userconfig_flash_write();

    return RetVal;
}
int system_IsRegistered()
{
    int modeID;

    if ((modeID = userconfig_get(NULL, 0, MODE_ID)) < 0)
    {
    	 UART_PRINT("MODE_GET_CONFIG_FAIL, error=%d\r\n", modeID);
        return -1;
    }
    if (modeID != DEV_REGISTERED)
    {
    	audio_mode = DEV_NOT_REGISTERED;
    	UART_PRINT("MODE_GET_CONFIG DEV_NOT_REGISTERED %d\r\n", audio_mode);
        return -1;
    }
    else
    {
    	 audio_mode = DEV_REGISTERED;
    	 UART_PRINT("MODE_GET_CONFIG DEV_REGISTERED %d\r\n", audio_mode);
        return 0;
    }
}

int system_Deregister(void)
{
//    int32_t lRetVal;
    userconfig_set(NULL, DEV_NOT_REGISTERED, MODE_ID);
    userconfig_flash_write();

    sl_WlanProfileDel(0xFF);
    ConfigureSimpleLinkToDefaultState(gMode);
    /*InitializeAppVariables();*/
    return 0;
}

#if OPENFILE

int SendFile_Tcp(unsigned int uip, unsigned short  usPort)
{
	int             iCounter;
	int             iAddrSize;
	int             iSockID;
	int             iStatus;
	int             itx = 1;

	SlSockAddr_t	*sa;
	sockAddr_t 		sAddr;
	int32_t         nonBlocking;
	long 			buflen;
	unsigned long   Offset = 0;
	_i32 fd = -1;
	int nb			= 0;


	Offset = 0;
//	sl_Start(0, 0, 0);
	fd = sl_FsOpen(TEST_FILENAME_MY, SL_FS_READ, 0);
	if(fd < 0)
	{
		UART_PRINT("sl_FsOpen error: %d\n\r", fd);
	}
	else
	{
		UART_PRINT("Reading file\n\r");
		buflen =  sl_FsRead(fd, Offset, (_u8*)gcBsdBuf_File, MAX_FILE_SIZE);
		UART_PRINT("Read \"%s\" (%d bytes)...\n\r", gcBsdBuf_File, buflen);
	}

	//filling the TCP server socket address
	sAddr.in4.sin_family = SL_AF_INET;
	sAddr.in4.sin_port = sl_Htons((unsigned short)usPort);
	sAddr.in4.sin_addr.s_addr = sl_Htonl((unsigned int)uip);

	sa = (SlSockAddr_t*)&sAddr.in4;
	iAddrSize = sizeof(SlSockAddrIn_t);

	// creating a TCP socket
	iSockID = sl_Socket(sa->sa_family, SL_SOCK_STREAM, 0);
	ASSERT_ON_ERROR(iSockID, SL_SOCKET_ERROR);

	if(nb == TRUE)
	{
		nonBlocking = TRUE;
		iStatus = sl_SetSockOpt(iSockID, SL_SOL_SOCKET, SL_SO_NONBLOCKING, &nonBlocking, sizeof(nonBlocking));

		if(iStatus< 0)
		{
			UART_PRINT("[line:%d, error:%d] %s\n\r", __LINE__, iStatus,
					   SL_SOCKET_ERROR);
			sl_Close(iSockID);
			return(-1);
		}
	}
	iStatus = -1;

	// connecting to TCP server
	while(iStatus < 0)
	{

		iStatus = sl_Connect(iSockID, sa, iAddrSize);
		UART_PRINT("iStatus %d\n\r", iStatus);
		if((iStatus == SL_ERROR_BSD_EALREADY)&& (nb == TRUE))
		{
			sleep(1);
			continue;
		}
		else if(iStatus < 0)
		{
			UART_PRINT("[line:%d, error:%d] %s\n\r", __LINE__, iStatus, SL_SOCKET_ERROR);
			sl_Close(iSockID);
			return(-1);
		}
		break;
	}

	iCounter = 0;
	if(itx == 1)
	{
		while(iCounter < 1)
		{
			/* Send packets to the server */
			iStatus = sl_Send(iSockID, &gcBsdBuf_File, buflen, 0);
			if((iStatus == SL_ERROR_BSD_EAGAIN) && (nb == TRUE))
			{
				sleep(1);
				continue;
			}
			else if(iStatus < 0)
			{
				UART_PRINT("[line:%d, error:%d] %s\n\r", __LINE__, iStatus, SL_SOCKET_ERROR);
				sl_Close(iSockID);
				return(-1);
			}
			iCounter++;
		}
		UART_PRINT("Sent %u packets (%u bytes) (data:%s) successfully\n\r", iCounter, buflen, gcBsdBuf_File);

	}

	iStatus = sl_Close(iSockID);
	ASSERT_ON_ERROR(iStatus, SL_SOCKET_ERROR);

	fd = sl_FsClose(fd, 0, 0, 0);
	if(fd < 0)
	{
		UART_PRINT("sl_FsClose error: %d\n\r", fd);
	}
	return 0;
}

int ReceFile_Tcp(unsigned short  usPort)
{

//	int32_t             iCounter;
	int32_t             iAddrSize;
	int32_t				iSockID;
	int32_t            	iStatus;
	int32_t             iNewSockID = -1;
	int32_t         	lNonBlocking = FALSE;
	_i32            RetVal = -1;
	SlSockAddr_t    *sa;
	SlSockAddr_t    *csa;
	sockAddr_t 		sAddr;
	int nb			= 0;
	int rx			= 1;
	_i32 fd 		= -1;
	unsigned long   Offset = 0;
	long 			buflen = 0;
//	sl_Start(0, 0, 0);

	SlFsFileInfo_t FsFileInfo;

	if(sl_FsGetInfo(FILENAME_MY, 0, &FsFileInfo) < 0)
	{
		UART_PRINT("Prepare Create File\n\r");
		fd = sl_FsOpen((unsigned char *)FILENAME_MY, (SL_FS_CREATE | SL_FS_WRITE  | SL_FS_CREATE_MAX_SIZE(MAX_FILE_SIZE_NEW)), 0);
		if(fd < 0)
		{
			UART_PRINT("sl_FsOpen error ReceFile_Tcp: %d\n\r", fd);
			return fd;
		}
		else
		{
			UART_PRINT("Create File Success\n\r");
	        RetVal = sl_FsClose(fd, 0, 0, 0);
	        if (SL_RET_CODE_OK != RetVal)
	        {
	            _ASSERT_ON_ERROR(FILE_CLOSE_ERROR);
	        }
		}

