caonguyenheo/cafe_milk/cc3220mode_module/programs/p2p/app/system.c
	}
	else
	{
		UART_PRINT("File Exists\n\r");
	}
	st_listFiles(40,0);

	    // filling the buffer
	memset(gcBsdBuf_File_Rx, 0x0, sizeof(gcBsdBuf_File_Rx));
//	for (iCounter=0 ; iCounter<1024 ; iCounter++)
//	{
//		gcBsdBuf_File_Rx[iCounter] = (char)(iCounter % 10);
//	}

	sAddr.in4.sin_family = SL_AF_INET;

	/* Set the server's port:
	   We'll receive connection requests on this port */
	sAddr.in4.sin_port = sl_Htons((unsigned short)usPort);
	sAddr.in4.sin_addr.s_addr = SL_INADDR_ANY;

	sa = (SlSockAddr_t*)&sAddr.in4;
	csa = (SlSockAddr_t*)&sAddr.in4;
	iAddrSize = sizeof(SlSockAddrIn_t);
	// creating a TCP socket
	iSockID = sl_Socket(sa->sa_family, SL_SOCK_STREAM, 0);
	ASSERT_ON_ERROR(iSockID, SL_SOCKET_ERROR);



	// binding the TCP socket to the TCP server address
	iStatus = sl_Bind(iSockID, sa, iAddrSize);

	if( iStatus < 0 )
	{
		// error
		UART_PRINT("[line:%d, error:%d] %s\n\r", __LINE__, iStatus,
				   SL_SOCKET_ERROR);
		sl_Close(iSockID);
		return(-1);
	}

	// putting the socket for listening to the incoming TCP connection
	iStatus = sl_Listen(iSockID, 0);
	if( iStatus < 0 )
	{
		UART_PRINT("[line:%d, error:%d] %s\n\r", __LINE__, iStatus,
				   SL_SOCKET_ERROR);
		sl_Close(iSockID);
		return(-1);
	}
	if(nb == TRUE)
	{
		lNonBlocking = TRUE;

		iStatus = sl_SetSockOpt(iSockID, SL_SOL_SOCKET, SL_SO_NONBLOCKING,
								&lNonBlocking, sizeof(lNonBlocking));
		if(iStatus < 0)
		{
			UART_PRINT("[line:%d, error:%d] %s\n\r", __LINE__, iStatus,
					   SL_SOCKET_ERROR);
			return(-1);
		}
		iNewSockID = SL_ERROR_BSD_EAGAIN;
	}

	// waiting for an incoming TCP connection
	while( iNewSockID < 0 )
	{
		// accepts a connection form a TCP client, if there is any
		// otherwise returns SL_EAGAIN
		iNewSockID = sl_Accept(iSockID, csa, (SlSocklen_t*)&iAddrSize);
		UART_PRINT("iNewSockID:%d\n\r",iNewSockID);
		if( (iNewSockID == SL_ERROR_BSD_EAGAIN) && nb == TRUE)
		{
			UART_PRINT("Sleep\n\r");
			sleep(1);
		}
		else if( iNewSockID < 0 )
		{
			// error
			UART_PRINT("[line:%d, error:%d] %s\n\r", __LINE__, iStatus, SL_SOCKET_ERROR);
			sl_Close(iNewSockID);
			sl_Close(iSockID);
			return(-1);
		}
	}

	UART_PRINT("Connected to client: ");
	sAddr.in4.sin_addr.s_addr = sl_Htonl(sAddr.in4.sin_addr.s_addr);
	PrintIPAddress(0,(void*)&sAddr.in4.sin_addr);
	UART_PRINT("\n\r");

//	int i = 0;
	if(rx == 1)
	{
		uint32_t rcvd_bytes = 0;
		while(rcvd_bytes < (MAX_FILE_SIZE))
		{
			iStatus = sl_Recv(iNewSockID, &gcBsdBuf_File_Rx, (MAX_FILE_SIZE),0);
			if((iStatus == SL_ERROR_BSD_EAGAIN) && (nb == TRUE))
			{
				sleep(1);
				continue;
			}
			else if(iStatus < 0)
			{
				UART_PRINT("[line:%d, error:%d] %s\n\r", __LINE__, iStatus, BSD_SOCKET_ERROR);
				sl_Close(iSockID);
				return(-1);
			}
			else if(iStatus == 0)
			{
				UART_PRINT("TCP Client closed the connection \n\r");
				break;
			}

			rcvd_bytes += iStatus;
		}

		UART_PRINT("Received %u packets (%u bytes) (data:%s) successfully \n\r",
				   (1), rcvd_bytes, gcBsdBuf_File_Rx);

		fd = sl_FsOpen(FILENAME_MY, SL_FS_WRITE , 0);
		if(fd < 0)
		{
			UART_PRINT("Not Open File \"%s\" %d To Write\n\r", FILENAME_MY, fd);
		}
		else
		{
			buflen = sl_FsWrite(fd, Offset,(_u8 *)gcBsdBuf_File_Rx, MAX_FILE_SIZE);
			UART_PRINT("Wrote %d bytes...\n\r", buflen);
		}

	}

	iStatus = sl_Close(iNewSockID);
	ASSERT_ON_ERROR(iStatus, SL_SOCKET_ERROR);

	iStatus = sl_Close(iSockID);
	ASSERT_ON_ERROR(iStatus, SL_SOCKET_ERROR);

	sl_FsClose(fd, NULL, NULL , 0);

	Offset = 0;
	fd  = -1;
	buflen = 0;
	fd = sl_FsOpen(FILENAME_MY, SL_FS_READ, 0);
    if(fd < 0)
    {
        UART_PRINT("sl_FsOpen error: %d\n\r", fd);
    }
    else
    {
    	memset(gcBsdBuf_File, 0x0, sizeof(gcBsdBuf_File));
    	buflen = sl_FsRead(fd, Offset, (_u8*)gcBsdBuf_File, MAX_FILE_SIZE);
    	if(buflen > 0)
    	{
			UART_PRINT("Read back %d bytes...\n\r", buflen);
			UART_PRINT("Read from file %s \n\r", gcBsdBuf_File);

    	}

        fd  = sl_FsClose(fd, 0, 0, 0);
        if(fd < 0)
        {
            UART_PRINT("sl_FsClose error: %d\n\r", fd );
        }
    }
	return(0);
}
#endif


# if 0
int TcpClient(unsigned int uip, unsigned short  usPort, char *buff, int nb, int tx)
{
    int             iCounter;
    int             iAddrSize;
    int             iSockID;
    int             iStatus;

    SlSockAddr_t	*sa;
    sockAddr_t 		sAddr;
//    int32_t         nonBlocking;
//    _u32 TimeOut = 0;
//    start:
    memset(gBuff_tx, 0x0, sizeof(gBuff_tx));
    for (iCounter=0 ; iCounter<BUFF_SIZE ; iCounter++)
    {
//        gBuff_tx[iCounter] = (char)(iCounter % 10);
    	gBuff_tx[iCounter] =  buff[iCounter];
    }
//    memset(&app_CB.gDataBuffer.nwData, 0x0, sizeof(app_CB.gDataBuffer));
//
//    /* filling the buffer with data */
//    for(iCounter = 0; iCounter < MAX_BUF_SIZE; iCounter++)
//    {
////        app_CB.gDataBuffer.nwData[i] = (char)(i % 10);
//        app_CB.gDataBuffer.nwData[iCounter] = buff[iCounter];
//    }

    //filling the TCP server socket address
    sAddr.in4.sin_family = SL_AF_INET;
    sAddr.in4.sin_port = sl_Htons((unsigned short)usPort);
    sAddr.in4.sin_addr.s_addr = sl_Htonl((unsigned int)uip);

    sa = (SlSockAddr_t*)&sAddr.in4;
    iAddrSize = sizeof(SlSockAddrIn_t);

    // creating a TCP socket
    iSockID = sl_Socket(sa->sa_family, SL_SOCK_STREAM, 0);
    ASSERT_ON_ERROR(iSockID, SL_SOCKET_ERROR);

    if(nb == TRUE)
    {
//        nonBlocking = TRUE;
//        nonBlocking = FALSE;
    	SlSockNonblocking_t BlockingOption;
    	BlockingOption.NonBlockingEnabled = 0;
//        TimeOut = 120;
        iStatus = sl_SetSockOpt(iSockID, SL_SOL_SOCKET, SL_SO_NONBLOCKING, &BlockingOption, sizeof(BlockingOption));
//        iStatus = sl_SetSockOpt(iSockID, SL_SOL_SOCKET, SL_SO_KEEPALIVETIME,( _u8*) &TimeOut, sizeof(TimeOut));
        if(iStatus< 0)
        {
            UART_PRINT("[line:%d], [error:%d], [function: %s], [%s]\n\r", __LINE__, iStatus, __FUNCTION__,
                       SL_SOCKET_ERROR);
            sl_Close(iSockID);
            return(-1);
        }
    }
    iStatus = -1;

