caonguyenheo/cafe_milk/cc3220mode_module/programs/p2p/app/system.c
    // connecting to TCP server
    while(iStatus < 0)
    {

    	iStatus = sl_Connect(iSockID, sa, iAddrSize);
    	UART_PRINT("iStatus %d\n\r", iStatus);
        if((iStatus == SL_ERROR_BSD_EALREADY)&& (nb == TRUE))
        {
            sleep(1);
            continue;
        }
        else if(iStatus < 0)
        {
            UART_PRINT("[line:%d], [error:%d], [function:%s], [%s]\n\r", __LINE__, iStatus, __FUNCTION__, SL_SOCKET_ERROR);
            sl_Close(iSockID);
            return(-1);
        }
        break;
    }

    iCounter = 0;
    if(tx == 1)
    {
		int32_t buflen;
		uint32_t sent_bytes = 0;
		uint32_t bytes_to_send = (1000 * BUFF_SIZE);
		while(sent_bytes < bytes_to_send)
		{

			if(bytes_to_send - sent_bytes >= BUFF_SIZE)
			{
				buflen = BUFF_SIZE;
			}
			else
			{
				buflen = bytes_to_send - sent_bytes;
			}

			/* Send packets to the server */
//			iStatus = sl_Send(iSockID, &gBuff_tx, buflen, 0);
			iStatus = sl_Send(iSockID, &gBuff_tx, sizeof(gBuff_tx), 0);
			//SL_ERROR_BSD_ECONNREFUSED  SL_ERROR_BSD_EAGAIN //
			if((iStatus == SL_ERROR_BSD_EAGAIN) && (nb == TRUE))
			{
				sleep(1);
				continue;
			}
			else if(iStatus < 0)
			{
				UART_PRINT("[line:%d], [error:%d], [function:%s], [%s]\n\r", __LINE__, iStatus, __FUNCTION__, SL_SOCKET_ERROR);
				sl_Close(iSockID);
				return(-1);
			}
			iCounter++;
			sent_bytes += iStatus;

		}
		UART_PRINT("Sent %u packets (%u bytes) (data:%s) successfully\n\r", iCounter, sent_bytes, gBuff_tx);
		memset(gBuff_tx, 0x0, sizeof(gBuff_tx));
		iStatus = sl_Recv(iSockID, &gBuff_tx, sizeof(gBuff_tx), 0);
		if( 0 > iStatus )
		{
			UART_PRINT("[line:%d], [error:%d], [function:%s], [%s]\n\r", __LINE__, iStatus, __FUNCTION__, SL_SOCKET_ERROR);
		}
		UART_PRINT("Recv [data:%s] [function:%s] successfully\n\r", gBuff_tx, __FUNCTION__);
    }
    else
    {
    	uint32_t rcvd_bytes = 0;

		while(rcvd_bytes < (1000 * BUFF_SIZE))
		{
			iStatus = sl_Recv(iSockID, &gBuff_tx, MAX_BUF_SIZE, 0);
			if((iStatus == SL_ERROR_BSD_EAGAIN) && (TRUE == 1))
			{
				UART_PRINT("Sleep rece\n\r");
				sleep(1);
				continue;
			}
			else if(iStatus < 0)
			{
				UART_PRINT("[line:%d, error:%d] %s\n\r", __LINE__, iStatus, BSD_SOCKET_ERROR);
				sl_Close(iSockID);
				return(-1);
			}
			else if(iStatus == 0)
			{
				UART_PRINT("TCP Server closed the connection\n\r");
				break;
			}
			rcvd_bytes += iStatus;
		}

		UART_PRINT("Received %u packets (%u bytes) (data:%s) successfully\n\r",
				   (rcvd_bytes / BUFF_SIZE), rcvd_bytes, &gBuff_tx);
    }
    iStatus = sl_Close(iSockID);
    ASSERT_ON_ERROR(iStatus, SL_SOCKET_ERROR);
    return 0;
}

int TcpServer(unsigned short  usPort, int nb, int tx)
{

	int32_t             iCounter;
	int32_t             iAddrSize;
    int32_t				iSockID;
    int32_t            	iStatus;

    int32_t             iNewSockID = -1;
//    int32_t         	lNonBlocking = FALSE;

    SlSockAddr_t    *sa;
    SlSockAddr_t    *csa;
    sockAddr_t sAddr;
//    _u32 TimeOut = 0;


	SlTimeval_t timeout;
	timeout.tv_sec = 30;
	SlFdSet_t readsds;
	SlFdSet_t writesds;
	int32_t            Status = -1;
    // filling the buffer
    memset(gBuff_tx, 0x0, sizeof(gBuff_tx));
    for (iCounter=0 ; iCounter<BUF_LEN ; iCounter++)
    {
    	gBuff_tx[iCounter] = (char)(iCounter % 10);
    }
//    memset(&app_CB.gDataBuffer.nwData, 0x0, sizeof(app_CB.gDataBuffer));
//
//    /* clear the global data buffer */
//    for(iCounter = 0; iCounter < MAX_BUF_SIZE; iCounter++)
//    {
////        app_CB.gDataBuffer.nwData[i] = (char)(i % 10);
//        app_CB.gDataBuffer.nwData[iCounter] = (char)(iCounter % 10);
//    }
    //filling the TCP server socket address
    sAddr.in4.sin_family = SL_AF_INET;

    /* Set the server's port:
	   We'll receive connection requests on this port */
    sAddr.in4.sin_port = sl_Htons((unsigned short)usPort);
    sAddr.in4.sin_addr.s_addr = SL_INADDR_ANY;

    sa = (SlSockAddr_t*)&sAddr.in4;
    csa = (SlSockAddr_t*)&sAddr.in4;
    iAddrSize = sizeof(SlSockAddrIn_t);
    // creating a TCP socket
    iSockID = sl_Socket(sa->sa_family, SL_SOCK_STREAM, 0);
    ASSERT_ON_ERROR(iSockID, SL_SOCKET_ERROR);



    // binding the TCP socket to the TCP server address
    iStatus = sl_Bind(iSockID, sa, iAddrSize);

    if( iStatus < 0 )
    {
        // error
    	UART_PRINT("[line:%d], [error:%d], [function:%s], [%s]\n\r", __LINE__, iStatus, __FUNCTION__, SL_SOCKET_ERROR);
        sl_Close(iSockID);
        return(-1);
    }

    // putting the socket for listening to the incoming TCP connection
    iStatus = sl_Listen(iSockID, 2);
    if( iStatus < 0 )
    {
    	UART_PRINT("[line:%d], [error:%d], [function:%s], [%s]\n\r", __LINE__, iStatus, __FUNCTION__, SL_SOCKET_ERROR);
        sl_Close(iSockID);
        return(-1);
    }
    else
    {
    	Report("Prepare Connection\n\r");

		SL_SOCKET_FD_ZERO(&readsds);
		SL_SOCKET_FD_SET(iSockID + 1, &readsds);
		Status = sl_Select(iSockID + 1, &readsds, &writesds, NULL, &timeout);
		if(Status > 0)
		{
			Report("Connection readsds [%d] writesds[%d] Status[%d] \n\r", readsds, writesds, Status);
		}
		else if(Status == 0)
		{
			Report("Connection Timeout [%d]s\n\r",timeout.tv_sec);
			sl_Close(iSockID);
			_ASSERT_ON_ERROR(LISTEN_ERROR);
			system_reboot();
		}
        else
        {
			Report("connection error (code : %d)\r\n", Status);
			sl_Close(iSockID);
			_ASSERT_ON_ERROR(LISTEN_ERROR);
			system_reboot();
        }
    }
    if(nb == TRUE)
    {
//    	lNonBlocking = TRUE;
//    	lNonBlocking = FALSE;
    	SlSockNonblocking_t BlockingOption;
    	BlockingOption.NonBlockingEnabled = 0;
    	Report("KEEP ALIVE TIME\n\r");
        iStatus = sl_SetSockOpt(iSockID, SL_SOL_SOCKET, SL_SO_NONBLOCKING,
                                &BlockingOption, sizeof(BlockingOption));
//        TimeOut = 120;
//        iStatus = sl_SetSockOpt(iSockID, SL_SOL_SOCKET, SL_SO_KEEPALIVETIME,( _u8*) &TimeOut, sizeof(TimeOut));
//        iStatus = sl_SetSockOpt(iSockID, SL_SOL_SOCKET, SL_SO_KEEPALIVE,( _u8*) &enableOption, sizeof(enableOption));
        if(iStatus < 0)
        {
        	UART_PRINT("[line:%d], [error:%d], [function:%s], [%s]\n\r", __LINE__, iStatus, __FUNCTION__, SL_SOCKET_ERROR);
            return(-1);
        }
        iNewSockID = SL_ERROR_BSD_EAGAIN;
    }

