caonguyenheo/cafe_milk/cc3220mode_module/programs/p2p/app/system.c
    // waiting for an incoming TCP connection
    while( iNewSockID < 0 )
    {
        // accepts a connection form a TCP client, if there is any
        // otherwise returns SL_EAGAIN
		iNewSockID = sl_Accept(iSockID, csa, (SlSocklen_t*)&iAddrSize);
		UART_PRINT("iNewSockID:%d\n\r",iNewSockID);

        if( (iNewSockID == SL_ERROR_BSD_EAGAIN) && nb == TRUE)
        {
        	UART_PRINT("Sleep\n\r");
        	sleep(1);
        }
        else if( iNewSockID < 0 )
        {
            // error
        	UART_PRINT("[line:%d], [error:%d], [function:%s], [%s]\n\r", __LINE__, iNewSockID, __FUNCTION__, SL_SOCKET_ERROR);
            sl_Close(iNewSockID);
            sl_Close(iSockID);
            return(-1);
        }

    }
    UART_PRINT("Connected to client: ");
    sAddr.in4.sin_addr.s_addr = sl_Htonl(sAddr.in4.sin_addr.s_addr);
    PrintIPAddress(0,(void*)&sAddr.in4.sin_addr);
    UART_PRINT("\n\r");
    // waits for 1000 packets from the connected TCP client
    int i = 0;
	if(tx == 1)
	{
		int32_t buflen;
		uint32_t sent_bytes = 0;
		uint32_t bytes_to_send = (1000 * BUF_LEN);

		while(sent_bytes < bytes_to_send)
		{
		if(bytes_to_send - sent_bytes >= BUF_LEN)
		{
			buflen = BUF_LEN;
		}
		else
		{
			buflen = bytes_to_send - sent_bytes;
		}

		/* Send packets to server */
		iStatus = sl_Send(iSockID, &gBuff_tx, buflen, 0);
		//            status = sl_Send(newsock, &app_CB.CmdBuffer, buflen, 0);
		if((iStatus == SL_ERROR_BSD_EAGAIN) && (TRUE == 1))
		{
			sleep(1);
			continue;
		}
		else if(iStatus < 0)
		{
			UART_PRINT("[line:%d], [error:%d], [function:%s], [%s]\n\r", __LINE__, iStatus, __FUNCTION__, SL_SOCKET_ERROR);
			sl_Close(iNewSockID);
			sl_Close(iSockID);
			return(-1);
		}
		i++;
		sent_bytes += iStatus;
		}

		UART_PRINT("Sent %u packets (%u bytes) (data:%s) successfully\n\r",i,
			   sent_bytes, &app_CB.CmdBuffer[30]);
	}
	else
	{
		uint32_t rcvd_bytes = 0;

		while(rcvd_bytes < (1000 * BUF_LEN))
		{
			iStatus = sl_Recv(iNewSockID, &gBuff_tx, sizeof(gBuff_tx),0);
			if((iStatus == SL_ERROR_BSD_EAGAIN) && (nb == TRUE))
			{
				sleep(1);
				continue;
			}
			else if(iStatus < 0)
			{
				UART_PRINT("[line:%d], [error:%d], [function:%s], [%s]\n\r", __LINE__, iStatus, __FUNCTION__, BSD_SOCKET_ERROR);
				sl_Close(iSockID);
				return(-1);
			}
			else if(iStatus == 0)
			{
				UART_PRINT("TCP Client closed the connection \n\r");
				break;
			}

			rcvd_bytes += iStatus;

		}
		iStatus = sl_Send(iNewSockID, "ACK", strlen("ACK"), 0 );
		if( strlen("ACK") != iStatus )
		{
			UART_PRINT("[line:%d], [error:%d], [function:%s], [%s]\n\r", __LINE__, iStatus, __FUNCTION__, BSD_SOCKET_ERROR);
		}
		UART_PRINT("Received %u packets (%u bytes) (data:%s) successfully \n\r",
				   (rcvd_bytes / BUF_LEN), rcvd_bytes, &gBuff_tx);
		memset(gBuff_tx, 0x0, sizeof(gBuff_tx));

	}

	iStatus = sl_Recv(iNewSockID, &gBuff_tx, sizeof(gBuff_tx),0);

	if(0 == iStatus)
	{
		UART_PRINT("Status [%d] function[%s]\n\r", iStatus, __FUNCTION__);
		iStatus = sl_Close(iNewSockID);
		ASSERT_ON_ERROR(iStatus, SL_SOCKET_ERROR);

		iStatus = sl_Close(iSockID);
		ASSERT_ON_ERROR(iStatus, SL_SOCKET_ERROR);
	}

	return(0);
}


int TcpServer_cp(unsigned short  usPort, int nb, int tx)
{

	int32_t             iCounter;
	int32_t             iAddrSize;
    int32_t				iSockID;
    int32_t            	iStatus;

//    int32_t             iNewSockID = -1;
//    int32_t         	lNonBlocking = FALSE;

    SlSockAddr_t    *sa;
    SlSockAddr_t    *csa;
    sockAddr_t sAddr;
//    sockAddr_t sAddrclient;
//    _u32 TimeOut = 0;

//
//	SlTimeval_t timeout;
//	timeout.tv_sec = 120;
	SlFdSet_t fds,readfds;

//	SlFdSet_t writesds;
//	int Status = -1;
	int client_socket[10] = {0};
	int max_client = 10;
	int numbersock = 0;
	uint32_t rcvd_bytes = 0;
	unsigned int numpackets = 0;

    // filling the buffer
    memset(gBuff_tx, 0x0, sizeof(gBuff_tx));

    memset(client_socket, 0x0, sizeof(client_socket));



    sAddr.in4.sin_family = SL_AF_INET;
    sAddr.in4.sin_port = sl_Htons((unsigned short)usPort);
    sAddr.in4.sin_addr.s_addr = SL_INADDR_ANY;

    sa = (SlSockAddr_t*)&sAddr.in4;
    csa = (SlSockAddr_t*)&sAddr.in4;
    iAddrSize = sizeof(SlSockAddrIn_t);
    // creating a TCP socket
//    iSockID = sl_Socket(sa->sa_family, SL_SOCK_STREAM, 0);
    iSockID = sl_Socket(sa->sa_family, SL_SOCK_STREAM, SL_IPPROTO_TCP);
    ASSERT_ON_ERROR(iSockID, SL_SOCKET_ERROR);

    // binding the TCP socket to the TCP server address
    iStatus = sl_Bind(iSockID, sa, iAddrSize);

    if( iStatus < 0 )
    {
        // error
    	ASSERT_ON_ERROR(iStatus, SL_SOCKET_ERROR);
        sl_Close(iSockID);
        return(-1);
    }

    // putting the socket for listening to the incoming TCP connection
    iStatus = sl_Listen(iSockID, 10);
    if( iStatus < 0 )
    {
    	ASSERT_ON_ERROR(iStatus, SL_SOCKET_ERROR);
        sl_Close(iSockID);
        return(-1);
    }

	SL_SOCKET_FD_ZERO(&fds);
	SL_SOCKET_FD_SET(iSockID, &fds);
    while(1)
    {
    	 readfds = fds;
    	 iStatus = sl_Select(SL_FD_SETSIZE, &readfds, NULL, NULL, NULL);
    	 _ASSERT_ON_ERROR(iStatus);


		for ( iCounter = 0 ; iCounter < SL_FD_SETSIZE ; iCounter++)
		{
			if(SL_SOCKET_FD_ISSET(iCounter, &readfds))
			{
				if(iSockID == iCounter)
				{
					if(numbersock < max_client)
					{
						client_socket[numbersock] = sl_Accept(iSockID, csa, (SlSocklen_t*)&iAddrSize);
						if(client_socket[numbersock] == -1)
						{
							_ASSERT_ON_ERROR(client_socket[numbersock]);
						}
						SL_SOCKET_FD_SET(client_socket[numbersock], &fds);
						numbersock++;
					}
					else
					{
						UART_PRINT("Ran out of socket space\n\r");
					}
				}
				else
				{

//					 bzero(gBuff_tx1, sizeof(gBuff_tx1));
					 while(rcvd_bytes < 1019)
					 {
						 iStatus = sl_Recv(iCounter, gBuff_tx, 1019,0);
						 if(iStatus  < 0)
						 {
							UART_PRINT("Reading Stream Message\n\r");
						 }
						 else if(iStatus == 0)
						 {
							UART_PRINT("Ending Connection\n\r");
						 }
						 else
						 {
							UART_PRINT("bytes at read [%d]\n\r", iStatus);
							UART_PRINT("-->data [%s]\n\r",gBuff_tx);
							rcvd_bytes += iStatus;
						 }

