caonguyenheo/cafe_milk/cc3220mode_module/programs/p2p/app/system.c
					 }
					 numpackets++;
					 UART_PRINT("-->one packet enough [%u] bytes [%u] numpackets[%d] \n\r",(rcvd_bytes/1024), rcvd_bytes, numpackets);
					 rcvd_bytes = 0;
					 memset(gBuff_tx, 0x0, sizeof(gBuff_tx));
				}

			}
		}

    }

	return(0);
}

/*int TcpServer_multithread(unsigned short  usPort)
{
	fd_set fds;
	fd_set readfds;
	int i = 0;
	int clientaddrlen = 0;
	int clientsock[NUMBERSOCKET] = {0};
	int rc = 0;
	int numsocks = 0;
	int maxsocks = 10;
	int ssocket = 0;
	int iStatus = 0;

	socket(AF_INET, SOCK_STREAM, IPPROTO_TCP);
	return 0;
}*/



int TcpClient_cp(unsigned int uip, unsigned short  usPort, char *buff, int nb, int tx)
{
    int             iCounter = 0;
    int             iAddrSize;
    int             iSockID;
    int             iStatus;
//    char acCmdStore[512];


//    int RetVal = 0;
    SlSockAddr_t	*sa;
    sockAddr_t 		sAddr;



    // filling the buffer
//    for (iCounter=0 ; iCounter<BUFF_SIZE ; iCounter++)
//    {
////        gBuff_tx[iCounter] = (char)(iCounter % 10);
//        gBuff_tx[iCounter] =  buff[iCounter];
//    }

    //filling the TCP server socket address
    sAddr.in4.sin_family = SL_AF_INET;
    sAddr.in4.sin_port = sl_Htons((unsigned short)usPort);
    sAddr.in4.sin_addr.s_addr = sl_Htonl((unsigned int)uip);

    sa = (SlSockAddr_t*)&sAddr.in4;
    iAddrSize = sizeof(SlSockAddrIn_t);

    // creating a TCP socket
    iSockID = sl_Socket(sa->sa_family, SL_SOCK_STREAM, 0);
    ASSERT_ON_ERROR(iSockID, SL_SOCKET_ERROR);


	iStatus = sl_Connect(iSockID, sa, iAddrSize);
	UART_PRINT("iStatus %d\n\r", iStatus);
	if(iStatus < 0)
    {
		ASSERT_ON_ERROR(iStatus, SL_SOCKET_ERROR);
        sl_Close(iSockID);
        return(-1);
    }

	UART_PRINT("SEND\n\r");
#if 0
    while(1)
    {


		iStatus = sl_Send(iSockID, *(gBuff_tx2+iCounter), 1024, 0);
		if(iStatus < 0)
		{
			_ASSERT_ON_ERROR(iStatus);
			goto Exit;
		}
		UART_PRINT("Send [data:%s] successfully\n\r", *(gBuff_tx2+iCounter));
		sleep(2);
		iCounter++;
		if(iCounter == 22)
		{
			iCounter = 0;
		}
    }
#endif

/*    while(1)
    {
    	UART_PRINT("SEND\n\r");

		RetVal = GetCmd(acCmdStore, sizeof(acCmdStore));

		if (RetVal < 0)
		{

			UART_PRINT("Command length exceeded 512 bytes in system \n\r");
		}

		iStatus = sl_Send(iSockID, &acCmdStore, sizeof(acCmdStore), 0);
		_ASSERT_ON_ERROR(iStatus);
		UART_PRINT("Send [data:%s] successfully\n\r", acCmdStore);

    }*/
Exit:
    iStatus = sl_Close(iSockID);
    ASSERT_ON_ERROR(iStatus, SL_SOCKET_ERROR);

    return 0;
}
int iSockID ;
int flag = 0;
//int client_group(unsigned int uip, unsigned short  usPort)
pthread_t reader = (pthread_t)NULL;
extern pthread_mutex_t clientMutex;
extern sem_t clientsem;
void *receive(void * param);

#endif
